// Lab_02.cpp
// < Волошин Олег >
// Лабораторна робота № 2.1
// Лінійні програми.
// Варіант 3
#include <iostream> // підключаємо бібліотеку вводу-виводу
#include <cmath> // математична бібліотека
using namespace std; // простір імен
int main()// головна функція - програма починає виконання
{
    double a;  // вхідний параметр
    double z1; // результат обчислення 1-го виразу
    double z2; // результат обчислення 2-го виразу
    cout << "a = ";// вивід в консоль вхідного параметра
    cin >> a; // ввід в консоль вхідного параметр
    //z1 = (sin(2 * a) + sin(5 * a) - sin(3 * a)) / (cos(a) + 1 - 2 * (sin(2 * a) * sin(2 * a))); // перший вираз
    z2 = 2 * sin(a); // другий вираз
    cout << endl;// Завдяки попередній інструкції, повідомлення виводиться в новому рядку
    //cout << "z1 = " << z1 << endl; // вивід  в консоль результату 1-го порядку
    cout << "z2 = " << z2 << endl; // вивід  в консоль результату 2-го порядку
    cout << "Зміна 1.2";
    cin.get();// організація затримки до натискання клавіші
    return 0;// вихід з фуннкції
    
}